IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DMASS0_INTAGGR_0_INTAGGR_MCAST.xml
<module name="DMASS0_INTAGGR_0_INTAGGR_MCAST" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="INTAGGR_MCAST_mcmap" acronym="INTAGGR_MCAST_mcmap" offset="0x0" width="64" description="This register determines how ingress global events from the ingress global event ETL are written out to the two egress global event ETL intefaces. The index of each of the two egress events is stored in this register, which is selected based in the ingress event index value.">
		<bitfield id="IRQMODE1" width="1" begin="63" end="63" resetval="0x0" description="IRQ Mode Flag 1.  When set, this register act like a mapper with bitnum in 37:32 and regnum in 46:38." range="63" rwaccess="R/W"/> 
		<bitfield id="GEVIDX1" width="16" begin="47" end="32" resetval="0x65535" description="Global event index 1.  This field specifies the index of the outgoing global event on ETL 1. Set to 0xFFFF to disable." range="47 - 32" rwaccess="R/W"/> 
		<bitfield id="IRQMODE0" width="1" begin="31" end="31" resetval="0x0" description="IRQ Mode Flag 0.  When set, this register act like a mapper with bitnum in 5:0 and regnum in 14:6." range="31" rwaccess="R/W"/> 
		<bitfield id="GEVIDX0" width="16" begin="15" end="0" resetval="0x65535" description="Global event index 0.  This field specifies the index of the outgoing global event on ETL 0. Set to 0xFFFF to disable." range="15 - 0" rwaccess="R/W"/>
	</register>
</module>